; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v8 - type_1 ?v6 - type_3)
 	      (pred_2 ?v4 - object ?v6 - type_3)
	      (pred_1 ?v8 - type_1 ?v5 - type_2)
	      (pred_3 ?v8 - type_1 ?v4 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v8 - type_1 ?v7 ?v3 - type_3)
       :precondition (and  (pred_4 ?v8 ?v7))
       :effect (and  (pred_4 ?v8 ?v3)
		     (not (pred_4 ?v8 ?v7))))

   (:action op_3
       :parameters (?v8 - type_1 ?v1 - object ?v2 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v2) (pred_4 ?v8 ?v2) (pred_1 ?v8 ?v5))
       :effect (and (pred_3 ?v8 ?v1 ?v5)
		    (not (pred_2 ?v1 ?v2)) 
		    (not (pred_1 ?v8 ?v5))))

   (:action op_1
       :parameters (?v8 - type_1 ?v1 - object ?v2 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v8 ?v1 ?v5) (pred_4 ?v8 ?v2))
       :effect (and (pred_2 ?v1 ?v2)
		    (pred_1 ?v8 ?v5)
		    (not (pred_3 ?v8 ?v1 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_10 - type_1
obj_09 obj_06 - type_2
obj_03 obj_08 obj_04 obj_05 - type_3
obj_02 obj_07 obj_01 - object)
(:init
(pred_4 obj_10 obj_04)
(pred_1 obj_10 obj_09)
(pred_1 obj_10 obj_06)
(pred_2 obj_02 obj_03)
(pred_2 obj_07 obj_03)
(pred_2 obj_01 obj_04)
)
(:goal
(and
(pred_2 obj_02 obj_05)
(pred_2 obj_07 obj_05)
(pred_2 obj_01 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_10 ?b obj_06))))
)
)

; plan
1. (op_2 obj_10 obj_04 obj_03)
   deleted: (pred_4 obj_10 obj_04)
   added: (pred_4 obj_10 obj_03)
   goals met: 1 of 3
2. (op_3 obj_10 obj_02 obj_03 obj_09)
   deleted: (pred_2 obj_02 obj_03) (pred_1 obj_10 obj_09)
   added: (pred_3 obj_10 obj_02 obj_09)
   goals met: 1 of 3
3. (op_2 obj_10 obj_03 obj_05)
   deleted: (pred_4 obj_10 obj_03)
   added: (pred_4 obj_10 obj_05)
   goals met: 1 of 3
4. (op_1 obj_10 obj_02 obj_05 obj_09)
   deleted: (pred_3 obj_10 obj_02 obj_09)
   added: (pred_2 obj_02 obj_05) (pred_1 obj_10 obj_09)
   goals met: 2 of 3
5. (op_2 obj_10 obj_05 obj_03)
   deleted: (pred_4 obj_10 obj_05)
   added: (pred_4 obj_10 obj_03)
   goals met: 2 of 3
6. (op_3 obj_10 obj_07 obj_03 obj_09)
   deleted: (pred_2 obj_07 obj_03) (pred_1 obj_10 obj_09)
   added: (pred_3 obj_10 obj_07 obj_09)
   goals met: 2 of 3
7. (op_2 obj_10 obj_03 obj_05)
   deleted: (pred_4 obj_10 obj_03)
   added: (pred_4 obj_10 obj_05)
   goals met: 2 of 3
8. (op_1 obj_10 obj_07 obj_05 obj_09)
   deleted: (pred_3 obj_10 obj_07 obj_09)
   added: (pred_2 obj_07 obj_05) (pred_1 obj_10 obj_09)
   goals met: 3 of 3
